<script setup lang="ts">
import { computed, defineComponent } from 'vue'
import { useRoute } from 'vue-router'

defineComponent({
  name: 'EducateDetail'
})

const json = [
  {
    id: 1,
    title: '全面提升健康教育：构建健康中国',
    date: '2024-04-25',
    desc: `一、健康教育的重要性
    健康教育是提升全民健康素养的关键，对于推进健康中国行动、实施教育现代化、建设教育强国具有重要意义。教育部印发通知，要求将健康教育融入学校教育教学各环节，培养师生健康意识、观念和生活方式，提高健康素养。

    二、健康教育的定义与意义
    健康素养是指个人获取、理解基本健康信息和服务，并作出正确判断和决定的能力。提升健康素养需要从树立科学健康理念、掌握基本知识、形成健康生活方式等方面入手。
    
    三、健康生活方式的四个方面
    合理膳食：国家提供膳食指导意见，普及营养知识。
    合理运动：体育运动对促进健康至关重要，需科学进行。
    心理健康：加强社会心理服务体系建设，培育积极社会心态。
    改变不良生活方式：远离熬夜、过量饮酒等不良习惯。
    
    四、健康教育的实施与挑战
    过去十年，健康教育工作得到社会各界广泛支持，呈现精准化态势。面对新冠疫情，健康教育在防控中发挥重要作用。同时，医务人员在提供服务时需开展健康教育，提升公众健康水平。
    
    五、健康教育的未来发展
    《中国健康教育》杂志作为健康教育的重要平台，提供了丰富的健康知识。教育部印发指南，将生命安全与健康教育融入中小学课程教材。同时，全国健康学校建设计划的实施，旨在将健康素养融入德智体美劳全面发展的教育体系中。
    
    结语
    健康教育是提升全民健康水平的基石。通过学校、医疗卫生机构、家庭和社会的共同努力，构建一个新时代、现代化、高质量的健康教育体系，为实现健康中国目标奠定坚实基础。`
  },
  {
    id: 2,
    title: '健康教育：从知识到实践的转变',
    date: '2024-04-20',
    desc: `一、健康教育的新视角
    健康教育不应仅仅停留在知识的传授上，更应重视实践技能的培养。在当前健康中国战略的背景下，健康教育正逐渐从传统的知识灌输向提升个人健康实践能力转变。

    二、健康教育的多维内容
    疾病预防：教育公众如何通过日常行为减少疾病风险，如戒烟、限酒、控制饮食等。
    健康生活方式：推广合理膳食、适量运动、良好睡眠等健康生活习惯。
    心理健康：提高公众对心理健康重要性的认识，提供应对压力和焦虑的策略。
    急救技能：普及基本的急救知识和技能，如心肺复苏(CPR)和止血包扎。

    三、健康教育的实施策略
    学校教育：将健康教育纳入学校课程，培养学生的健康意识和自我保健能力。
    社区参与：通过社区健康讲座、工作坊等形式，提高居民的健康知识水平。
    媒体宣传：利用电视、广播、网络等多种媒介，普及健康知识，提高公众健康意识。
    政策支持：政府应出台相关政策，支持健康教育的开展，如提供资金、设施等资源。

    四、健康教育的挑战与机遇
    信息过载：在信息爆炸的时代，如何筛选和传播准确的健康信息成为挑战。
    文化差异：不同文化背景下的健康观念和行为差异，需要个性化的健康教育方案。
    技术应用：利用移动互联网、大数据等现代技术，提高健康教育的效率和精准度。

    五、健康教育的未来发展
    健康教育应不断探索和探索，不断优化和优化，不断完善和完善。

    结语
    健康教育是提升全民健康素养的关键，通过学校、医疗卫生机构、家庭和社会的共同努力，构建一个新时代、现代化、高质量的健康教育体系，为实现健康中国目标奠定坚实的基础。`
  }
]
const route = useRoute()
const educateDetail = computed(() => {
  return json.find((item) => item.id === Number(route.query.id))
})
</script>

<template>
  <div class="mt-16px">
    <van-space
      direction="vertical"
      fill
    >
      <van-cell-group inset>
        <van-cell
          class="title"
          :title="educateDetail?.title"
          :label="educateDetail?.date"
        />
      </van-cell-group>
      <van-cell-group inset>
        <div
          class="desc"
          v-html="educateDetail?.desc"
        />
      </van-cell-group>
    </van-space>
  </div>
</template>

<style scoped>
.title {
  font-size: 20px;
}

.desc {
  padding: 16px;
  white-space: pre-wrap;
  overflow-wrap: break-word;
  font-size: 15px;
}
</style>
